# Дан список интов,повторяющихся элементов в списке нет. Нужно преобразовать это множество в строку, сворачивая
# соседние по числовому ряду числа в диапазоны.
# Примеры
# :
# [1,4,5,2,3,9,8,11,0] => "0-5,8-9,11"
# [1,4,3,2] => "1-4"
# [1,4] => "1,4"

l1 = [1, 4]
l1.sort()
count = l1[0]
for i in l1:
    if l1[0] == count:
        str_test = f"{l1[0]}"
    elif i != count:
        str_test += f"-{count-1}"
        count = i
        str_test += f",{count}"
    count += 1

print(str_test)
